[
  {
    "id": 1,
    "rating": 2,
    "snippet": "🤡🤡🤡 The lorry just park at the only exit lane and unload. I honk few times, the staff come out and see see. Then go back to work like nothing happened… not even say sorry or ask the driver to move away the truck, customers are clown 🤡 🤡 🤡. All the cars have to reverse… and the interior is very hot🔥 like no air cond…",
    "user": "Ng Burger",
    "isoDate": "4 months ago",
    "profilePicture": "https://lh3.googleusercontent.com/a-/ALV-UjV10rH3MyM3d_9-HnA60SjFKYelvdnXyO_turB2cSuIa3fwWAE=s120-c-rp-mo-ba3-br100",
    "classification": "Genuine-Negative",
    "confidence": "90",
    "explanation": "The reviewer expresses frustration with the parking situation and the staff's response, using strong language and emojis to convey their emotions. The specific details and tone suggest an authentic negative experience.",
    "raw": "Review 1:\nClassification: Genuine-Negative\nConfidence: 90\nExplanation: The reviewer expresses frustration with the parking situation and the staff's response, using strong language and emojis to convey their emotions. The specific details and tone suggest an authentic negative experience.\n\n"
  },
  {
    "id": 2,
    "rating": 3,
    "snippet": "The kfc here is big and empty since the boikot. I like portion of the chickens here. So big unlike the other kfc. But i dont like the attitude of one of the worker here. Very kerek, and didnt take note of my order since i specifically mentioned certain foods that I want her to change. Okay",
    "user": "Nurul Farihah",
    "isoDate": "11 months ago",
    "profilePicture": "https://lh3.googleusercontent.com/a-/ALV-UjUhihdxcEw9dA7IXVnshj3ot5mRacOja-hJ6keOlMWscXvgbp49=s120-c-rp-mo-ba3-br100",
    "classification": "Genuine-Negative",
    "confidence": "80",
    "explanation": "The reviewer mentions both positive (large portion of chicken) and negative (attitude of a worker) aspects of their experience, indicating a genuine review. The tone is casual and conversational, adding to the authenticity.",
    "raw": "Review 2:\nClassification: Genuine-Negative\nConfidence: 80\nExplanation: The reviewer mentions both positive (large portion of chicken) and negative (attitude of a worker) aspects of their experience, indicating a genuine review. The tone is casual and conversational, adding to the authenticity.\n\n"
  },
  {
    "id": 3,
    "rating": 5,
    "snippet": "I had a fantastic experience dining in at KFC Nilai Square Drive Thru! The food was hot, fresh, and delicious as always. The service was fast and friendly, the staff were polite and attentive to our needs. The atmosphere was clean, calm, and comfortable for a quick meal. A great place to grab a bite with family or friends. Definitely worth visiting again!",
    "user": "Lechumi Murugayah",
    "isoDate": "3 months ago",
    "profilePicture": "https://lh3.googleusercontent.com/a/ACg8ocIZ6r_Px2s0Z_EloZRhdyPxd7FLFGoQQ1XPszBzyQWUqRlnZQ=s120-c-rp-mo-br100",
    "classification": "Genuine-Positive",
    "confidence": "95",
    "explanation": "The review is extremely positive, but the specific details about the food, service, and atmosphere suggest a genuine experience. The tone is enthusiastic but not overly promotional.",
    "raw": "Review 3:\nClassification: Genuine-Positive\nConfidence: 95\nExplanation: The review is extremely positive, but the specific details about the food, service, and atmosphere suggest a genuine experience. The tone is enthusiastic but not overly promotional.\n\n"
  },
  {
    "id": 4,
    "rating": 2,
    "snippet": "It's a very nice place but lousy staff.\nThe food taste not so good too. Not as usual. I think because of the staff is lazy to take care of the premise. Table are left dirty even in front of the counter. Imagine how it's look in the kitchen ❓",
    "user": "Arejay Jay",
    "isoDate": "a month ago",
    "profilePicture": "https://lh3.googleusercontent.com/a-/ALV-UjUqD7mz5VGJvz690s76noVjR9kLKR8_ygN4QCKoJEvsraTf3gKHJQ=s120-c-rp-mo-ba5-br100",
    "classification": "Genuine-Negative",
    "confidence": "85",
    "explanation": "The reviewer expresses disappointment with the staff and food quality, providing specific examples to support their claims. The tone is critical but not overly aggressive, suggesting an authentic negative review.",
    "raw": "Review 4:\nClassification: Genuine-Negative\nConfidence: 85\nExplanation: The reviewer expresses disappointment with the staff and food quality, providing specific examples to support their claims. The tone is critical but not overly aggressive, suggesting an authentic negative review.\n\n"
  },
  {
    "id": 5,
    "rating": 5,
    "snippet": "I dined in at KFC Nilai Square DT and had a good experience overall. The food was hot, fresh, and served quite fast. Staff were polite and attentive, making the service efficient. The atmosphere was clean and well-maintained, suitable for families and casual dining.",
    "user": "Thamilaarashee Shanmugam",
    "isoDate": "4 months ago",
    "profilePicture": "https://lh3.googleusercontent.com/a/ACg8ocIclWPlBPi4AJh_eUe3RrOL8-51B1NZb1HzreJbPP2D6TopXw=s120-c-rp-mo-br100",
    "classification": "Genuine-Positive",
    "confidence": "90",
    "explanation": "The review is positive, but the specific details about the food, service, and atmosphere suggest a genuine experience. The tone is positive but not overly promotional, and the language is straightforward.",
    "raw": "Review 5:\nClassification: Genuine-Positive\nConfidence: 90\nExplanation: The review is positive, but the specific details about the food, service, and atmosphere suggest a genuine experience. The tone is positive but not overly promotional, and the language is straightforward.\n\n"
  },
  {
    "id": 6,
    "rating": 1,
    "snippet": "I think they need to learn how to provide better services from McD nearby.. just notice that this kfc already start using kiosk... They should have know that not everyone understand technology... They should atleast put 1 persons to assists customer like mcD nilai...\nSo as i was waiting, saw 1 akak with her 2 childrens waiting.. due to the great services this akak left the kfc without ordering..\nSo when i advised the staff... He was like saying if i have free time why i dont help other customer...\nThe best part is... Once i reach home to eat.. 1 set only have 1 chicken... Im writing review now because i cant accept the stupidity from the short foreign staf... I will go back to this kfc at 615pm today after finish eating to get back my another 1 piece chicken...  Today date 26 March 2022...",
    "user": "Mohd suhail Sulaiman",
    "isoDate": "3 years ago",
    "profilePicture": "https://lh3.googleusercontent.com/a/ACg8ocLNDkQAn4sez4Rk6uvw772BOvH_MHct3f3rd9pJejybdpptZA=s120-c-rp-mo-br100",
    "classification": "Genuine-Negative",
    "confidence": "95",
    "explanation": "The reviewer provides a detailed account of their negative experience, including specific incidents and dates. The tone is critical and frustrated, but the level of detail and the reviewer's willingness to return to the restaurant suggest an authentic review.",
    "raw": "Review 6:\nClassification: Genuine-Negative\nConfidence: 95\nExplanation: The reviewer provides a detailed account of their negative experience, including specific incidents and dates. The tone is critical and frustrated, but the level of detail and the reviewer's willingness to return to the restaurant suggest an authentic review.\n\n"
  },
  {
    "id": 7,
    "rating": 5,
    "snippet": "I had a great takeaway experience. The staff were polite and quick with my order. Everything was packed neatly, and the food remained hot and fresh.",
    "user": "Shanmugam A/l Ramasamy",
    "isoDate": "3 months ago",
    "profilePicture": "https://lh3.googleusercontent.com/a/ACg8ocINcZ75D0_iNR2WKb7_FDsRxt5uitaV2oztvkDDYrvCLUtTkw=s120-c-rp-mo-br100",
    "classification": "Genuine-Positive",
    "confidence": "90",
    "explanation": "The review is brief but positive, with specific details about the staff and food quality. The tone is positive but not overly promotional, suggesting an authentic review.",
    "raw": "Review 7:\nClassification: Genuine-Positive\nConfidence: 90\nExplanation: The review is brief but positive, with specific details about the staff and food quality. The tone is positive but not overly promotional, suggesting an authentic review.\n\n"
  },
  {
    "id": 8,
    "rating": 1,
    "snippet": "Friday. 23th May 2025. Around 8pm. We buy the zinger buger chezilla and cheesy zinger buger. The bread is dry. Not soft. The cheese inside the chezilla so hard to bite. Cannot bite. Very2 hard. Maybe yesterday cheese they put inside the burger. Please respect the customer. We pay for the food. Not for free. Please give the proper food to all customer. Please provide the better service.",
    "user": "emy nursyuhada nordin",
    "isoDate": "3 months ago",
    "profilePicture": "https://lh3.googleusercontent.com/a/ACg8ocLeMaEhrn8ugv0vfIV5G5xH2tV6x9QPRZm6pCga_z7-ckVSzQ=s120-c-rp-mo-br100",
    "classification": "Genuine-Negative",
    "confidence": "85",
    "explanation": "The reviewer provides specific details about their disappointing experience, including the date and time of their visit. The tone is critical, but the language is straightforward and the reviewer's demands for better service seem reasonable, suggesting an authentic review.",
    "raw": "Review 8:\nClassification: Genuine-Negative\nConfidence: 85\nExplanation: The reviewer provides specific details about their disappointing experience, including the date and time of their visit. The tone is critical, but the language is straightforward and the reviewer's demands for better service seem reasonable, suggesting an authentic review."
  },
  {
    "id": 9,
    "rating": 5,
    "snippet": "“The restaurant had a clean and welcoming atmosphere. It was comfortable to dine in, with a pleasant environment for enjoying meals.”",
    "user": "Mesh",
    "isoDate": "2 weeks ago",
    "profilePicture": "https://lh3.googleusercontent.com/a/ACg8ocJe4suqHhHSEH7ZEf8oG0nYXSFIALJfPsxbRksoarLjU9dg8A=s120-c-rp-mo-br100",
    "classification": "Genuine-Positive",
    "confidence": "90",
    "explanation": "The review provides specific details about the atmosphere and environment, indicating a genuine experience. The tone is positive and objective, without any exaggerated language.",
    "raw": "Review 1:\nClassification: Genuine-Positive\nConfidence: 90\nExplanation: The review provides specific details about the atmosphere and environment, indicating a genuine experience. The tone is positive and objective, without any exaggerated language.\n\n"
  },
  {
    "id": 10,
    "rating": 2,
    "snippet": "No aircond & children's playground is also closed, overall the experienced is uncomfortable to eating here. Sadly this is a whole building but they unable to manage the outlet properly.",
    "user": "Khairul Anwar Azmi",
    "isoDate": "5 months ago",
    "profilePicture": "https://lh3.googleusercontent.com/a-/ALV-UjUXbzDT8lcg2LRz_WTodDdGamc0MwAz0qR7jqAhIUS_Zt2kyHdh=s120-c-rp-mo-ba4-br100",
    "classification": "Genuine-Negative",
    "confidence": "95",
    "explanation": "The review lists specific issues with the restaurant, including the lack of air conditioning and a closed playground. The tone is negative, but the language is straightforward and descriptive, suggesting a genuine complaint.",
    "raw": "Review 2:\nClassification: Genuine-Negative\nConfidence: 95\nExplanation: The review lists specific issues with the restaurant, including the lack of air conditioning and a closed playground. The tone is negative, but the language is straightforward and descriptive, suggesting a genuine complaint.\n\n"
  },
  {
    "id": 11,
    "rating": 1,
    "snippet": "Bought snacks plate and both drumstick look super pathetic. Small size and you can even see the bone!!! Pricey for this kind of quality. You gotta do better, KFC!!!",
    "user": "Cheeky Panda",
    "isoDate": "a year ago",
    "profilePicture": "https://lh3.googleusercontent.com/a/ACg8ocIBkXQW6igbvmIoXwL3qFVelI6118OfMVNd0PW67KzZ3Zlj1Q=s120-c-rp-mo-ba4-br100",
    "classification": "Genuine-Negative",
    "confidence": "95",
    "explanation": "The review provides specific details about the food, including the size and quality of the drumsticks. The tone is negative and frustrated, but the language is descriptive and objective, suggesting a genuine complaint.",
    "raw": "Review 3:\nClassification: Genuine-Negative\nConfidence: 95\nExplanation: The review provides specific details about the food, including the size and quality of the drumsticks. The tone is negative and frustrated, but the language is descriptive and objective, suggesting a genuine complaint.\n\n"
  },
  {
    "id": 12,
    "rating": 5,
    "snippet": "Fast and smooth drive thru experience. Friendly staff and food was fresh. Definitely convenient and satisfying.",
    "user": "Janaki Kannaiah",
    "isoDate": "2 months ago",
    "profilePicture": "https://lh3.googleusercontent.com/a/ACg8ocLPy86EALVZxhR-06nNucfSyoczcEJkcaels_NzgqkwEeR8=s120-c-rp-mo-br100",
    "classification": "Genuine-Positive",
    "confidence": "90",
    "explanation": "The review provides specific details about the drive-thru experience, including the speed and friendliness of the staff. The tone is positive and objective, without any exaggerated language.",
    "raw": "Review 4:\nClassification: Genuine-Positive\nConfidence: 90\nExplanation: The review provides specific details about the drive-thru experience, including the speed and friendliness of the staff. The tone is positive and objective, without any exaggerated language.\n\n"
  },
  {
    "id": 13,
    "rating": 1,
    "snippet": "Service totally down, i have try the new Ghost paper burger but the burger bread like dry n not fresh(like roti kering). The fries is more worst then the burger bread. Serve old fries which its chilled.( dont know when was fried). Better we go McD next time always fresh burger n chicken.",
    "user": "Samy Raj Samy",
    "isoDate": "6 years ago",
    "profilePicture": "https://lh3.googleusercontent.com/a/ACg8ocJ_zO-S7tuHE6zzkaNImpVtZSNfZDqFd7zELMQSuEev-eCw4Q=s120-c-rp-mo-br100",
    "classification": "Genuine-Negative",
    "confidence": "90",
    "explanation": "The review lists specific issues with the food, including the quality of the burger bread and fries. The tone is negative and frustrated, but the language is descriptive and objective, suggesting a genuine complaint.",
    "raw": "Review 5:\nClassification: Genuine-Negative\nConfidence: 90\nExplanation: The review lists specific issues with the food, including the quality of the burger bread and fries. The tone is negative and frustrated, but the language is descriptive and objective, suggesting a genuine complaint.\n\n"
  },
  {
    "id": 14,
    "rating": 5,
    "snippet": "Nice service. Good and hot food. Staffs are very friendly",
    "user": "Thavapriya Balasubramaniam",
    "isoDate": "2 months ago",
    "profilePicture": "https://lh3.googleusercontent.com/a/ACg8ocI4XMiDLjHyaLTF0-DW8M9Rup-DJ5X8l-rZQd-AklwScFZthA=s120-c-rp-mo-br100",
    "classification": "Genuine-Positive",
    "confidence": "85",
    "explanation": "The review provides brief but positive comments about the service and food. The tone is positive, but the language is somewhat generic, which reduces the confidence level.",
    "raw": "Review 6:\nClassification: Genuine-Positive\nConfidence: 85\nExplanation: The review provides brief but positive comments about the service and food. The tone is positive, but the language is somewhat generic, which reduces the confidence level.\n\n"
  },
  {
    "id": 15,
    "rating": 1,
    "snippet": "Seriously I'm fat up with this KFC ... Burger bread n chicken like no cook ... This what u guys serve customer... Please guys aware of this ... Don't go... My hamble req ... Or else please give quality of food to ur trust customer..I saw there is many children also.... Pls lah... Improve...tq",
    "user": "GASTURI GOBINATH",
    "isoDate": "2 years ago",
    "profilePicture": "https://lh3.googleusercontent.com/a-/ALV-UjW20bCN1ljs4vyQr4HXT4Z3nZvoR_HiSmYYakaBHK2kfxQklPs=s120-c-rp-mo-br100",
    "classification": "Genuine-Negative",
    "confidence": "90",
    "explanation": "The review provides specific details about the food, including the quality of the burger bread and chicken. The tone is negative and frustrated, with a sense of urgency and concern for the quality of food served to customers.",
    "raw": "Review 7:\nClassification: Genuine-Negative\nConfidence: 90\nExplanation: The review provides specific details about the food, including the quality of the burger bread and chicken. The tone is negative and frustrated, with a sense of urgency and concern for the quality of food served to customers.\n\n"
  },
  {
    "id": 16,
    "rating": 1,
    "snippet": "This kfc branch is in strategic lication of nilai but their quality of chicken is worst ever comparing to all kfc branches that i ever visited. The chicken is dry and tasteless and their drumstick is smaller than the wings! For nilai folks, If you ever thought of order kfc deliver through this branch, u will confirm disappointed if ur order come with customised chicken portion. They never bother to read ur delivery order instruction and preference. Terrible and worst kfc branch.",
    "user": "Jui Kok Tan",
    "isoDate": "3 years ago",
    "profilePicture": "https://lh3.googleusercontent.com/a/ACg8ocLprJp372J0WSa0t241Wif7Pb3C4brpNerKKeLeZTDH-40Ttg=s120-c-rp-mo-br100",
    "classification": "Genuine-Negative",
    "confidence": "95",
    "explanation": "The review provides specific details about the quality of the chicken, including comparisons to other branches. The tone is negative and critical, but the language is descriptive and objective, suggesting a genuine complaint.",
    "raw": "Review 8:\nClassification: Genuine-Negative\nConfidence: 95\nExplanation: The review provides specific details about the quality of the chicken, including comparisons to other branches. The tone is negative and critical, but the language is descriptive and objective, suggesting a genuine complaint."
  },
  {
    "id": 17,
    "rating": 5,
    "snippet": "I wanna rate 5 stars for this KFC branch.\nVery clean environment. They clean tables very fast.\nThe food are serving hot and the potion are stastify compare with other branchs especially KAJANG METRO branch.\nYou can order everything on menu even now is midnight 12am.\nThe counter staffs are friendly and didn't show any uncomfortable emotion to you when ordered.",
    "user": "Jun",
    "isoDate": "Edited 5 years ago",
    "profilePicture": "https://lh3.googleusercontent.com/a-/ALV-UjVKg325jpnw9lemT2q2SdbUKERvwwJRbCObbGtypHOt7oJIDgYTfw=s120-c-rp-mo-ba3-br100",
    "classification": "Genuine-Positive",
    "confidence": "95",
    "explanation": "The review is specific, detailed, and highlights several positive aspects of the KFC branch, including cleanliness, hot food, and friendly staff. The tone is enthusiastic and authentic.",
    "raw": "Review 1:\nClassification: Genuine-Positive\nConfidence: 95\nExplanation: The review is specific, detailed, and highlights several positive aspects of the KFC branch, including cleanliness, hot food, and friendly staff. The tone is enthusiastic and authentic.\n\n"
  },
  {
    "id": 18,
    "rating": 1,
    "snippet": "The most retarded KFC outlet! The staffs are very rude And it takes almost 30min To serve food! Only 2 staffs working at counter at peak hours. Food order kiosk have 3 But only 1 can be used n only Cash! Plz learn from MCd nearby on how To improve ur lousy Service! This place as If no Manager on board!",
    "user": "chitra Kumar",
    "isoDate": "3 years ago",
    "profilePicture": "https://lh3.googleusercontent.com/a/ACg8ocKnsS4DJIKDLPXx6D7IAAXsTWrwk_M7M4htQNUSPplc1a7ALw=s120-c-rp-mo-br100",
    "classification": "Genuine-Negative",
    "confidence": "90",
    "explanation": "The review is strongly negative, but the specific complaints about staff rudeness, long wait times, and limited payment options suggest a genuine bad experience. The tone is angry, but not overly dramatic or promotional.",
    "raw": "Review 2:\nClassification: Genuine-Negative\nConfidence: 90\nExplanation: The review is strongly negative, but the specific complaints about staff rudeness, long wait times, and limited payment options suggest a genuine bad experience. The tone is angry, but not overly dramatic or promotional.\n\n"
  },
  {
    "id": 19,
    "rating": 4,
    "snippet": "I prefer this outlet because it is clean. Nothing different is case of menu. Staff are friendly.",
    "user": "Rashedul Hasan",
    "isoDate": "6 years ago",
    "profilePicture": "https://lh3.googleusercontent.com/a-/ALV-UjWivnee9Zyq01QQKODY538DEf-_GWcWHZfqmp7C7ldH04p0AKNdpQ=s120-c-rp-mo-ba4-br100",
    "classification": "Genuine-Positive",
    "confidence": "80",
    "explanation": "The review is brief, but the mention of cleanliness and friendly staff suggests a positive experience. The tone is casual and authentic, but lacks specific details.",
    "raw": "Review 3:\nClassification: Genuine-Positive\nConfidence: 80\nExplanation: The review is brief, but the mention of cleanliness and friendly staff suggests a positive experience. The tone is casual and authentic, but lacks specific details.\n\n"
  },
  {
    "id": 20,
    "rating": 1,
    "snippet": "Stop was behaving not good\nThis is my last time in kfc buycott",
    "user": "Arham Khan",
    "isoDate": "a month ago",
    "profilePicture": "https://lh3.googleusercontent.com/a/ACg8ocJlU5c6q95qt0lRvsndeH6rSLtVaKlPwS7RO98buaLrvfH6OQ=s120-c-rp-mo-br100",
    "classification": "Fake-Malicious",
    "confidence": "70",
    "explanation": "The review is extremely brief and lacks specific details. The tone is vague and negative, suggesting a fake review intended to harm the business.",
    "raw": "Review 4:\nClassification: Fake-Malicious\nConfidence: 70\nExplanation: The review is extremely brief and lacks specific details. The tone is vague and negative, suggesting a fake review intended to harm the business.\n\n"
  },
  {
    "id": 21,
    "rating": 1,
    "snippet": "The staff was very rude and don't know how to speak they are not responsible",
    "user": "Asad Ali",
    "isoDate": "a month ago",
    "profilePicture": "https://lh3.googleusercontent.com/a-/ALV-UjXl_pnoHI9FyKO7Ej4VuOtLQ0sNFZFGk3BGGfLsjDpuKW2W7wOe=s120-c-rp-mo-br100",
    "classification": "Fake-Malicious",
    "confidence": "75",
    "explanation": "The review is brief and lacks specific details. The tone is overly negative and dramatic, suggesting a fake review intended to harm the business.",
    "raw": "Review 5:\nClassification: Fake-Malicious\nConfidence: 75\nExplanation: The review is brief and lacks specific details. The tone is overly negative and dramatic, suggesting a fake review intended to harm the business.\n\n"
  },
  {
    "id": 22,
    "rating": 1,
    "snippet": "Poor Value For Services Kfc Square Value 😑 Unsatisfactory, Slow Service, and do not apologize for the delay and say \"thank you\" also do not promise any discount or benefit once assisted(The KFc Manager asked our Help to wrap Pepsi drink in a plastic bag.),While Service Charges Have Been Paid To Kfc Nilai Square. * Food Pick up Time Agreement for 57 sets of Snack Plate is 14:30 pm.  But they haven't prepared it yet. * 👎🏿.**Full payment was made at 10am**",
    "user": "Puteri A.S.",
    "isoDate": "5 years ago",
    "profilePicture": "https://lh3.googleusercontent.com/a-/ALV-UjWXCA2eFHndsFE7KaidyUzyRLA_dgbLWKSAvOtPT2LQnyRbWmAv=s120-c-rp-mo-br100",
    "classification": "Genuine-Negative",
    "confidence": "95",
    "explanation": "The review is detailed and specific, highlighting several issues with the service, including slow service, lack of apology, and poor value. The tone is disappointed and frustrated, but authentic.",
    "raw": "Review 6:\nClassification: Genuine-Negative\nConfidence: 95\nExplanation: The review is detailed and specific, highlighting several issues with the service, including slow service, lack of apology, and poor value. The tone is disappointed and frustrated, but authentic.\n\n"
  },
  {
    "id": 23,
    "rating": 1,
    "snippet": "Yeah, no. Not again. Drumstick the size of your finger. Mushy mashed potatoes. Literally mashed together with the gravy. What a joke.",
    "user": "izzuL azree Sazli",
    "isoDate": "3 years ago",
    "profilePicture": "https://lh3.googleusercontent.com/a-/ALV-UjWpHhFpTaBl4Vf-Am1fdYDjgl7oNpTLcJ05YuXBqBPfHJ-Huhci=s120-c-rp-mo-ba3-br100",
    "classification": "Genuine-Negative",
    "confidence": "90",
    "explanation": "The review is strongly negative, but the specific complaints about food quality suggest a genuine bad experience. The tone is sarcastic, but not overly dramatic or promotional.",
    "raw": "Review 7:\nClassification: Genuine-Negative\nConfidence: 90\nExplanation: The review is strongly negative, but the specific complaints about food quality suggest a genuine bad experience. The tone is sarcastic, but not overly dramatic or promotional.\n\n"
  },
  {
    "id": 24,
    "rating": 2,
    "snippet": "Well, i went in this morning ordering twister but was told it was out of stock. Then, I ordered other things and was told only original chicken available. Nahh.. i only eat spicy though but, as usual. No stock. Then, this guy, attached photo with KFC shirt entered. Sat at the table there and he kinda show he is the boss by throwing his files.\n\nThen, i wanted to go out, he screamed \"Hello, keluar sana\"\n\nHere is my said to you dear sir, I am your customer and is this how you treat your customer? Well, kindly contact me if you want to learn customer service.\n\nAnd dear sir, nowadays rating is everything. If you wanna learn about marketing, please contact me. I will remember your always.",
    "user": "Lady D",
    "isoDate": "3 years ago",
    "profilePicture": "https://lh3.googleusercontent.com/a/ACg8ocKUMyGidtMlfUeBA3fCreKVVxejUP3gdl1qDeCbn_EJGPb9S1Q=s120-c-rp-mo-ba2-br100",
    "classification": "Fake-Promotional",
    "confidence": "85",
    "explanation": "The review is overly dramatic and promotional, with the reviewer offering to teach the business about customer service and marketing. The tone is condescending and insincere, suggesting a fake review intended to promote the reviewer's services.",
    "raw": "Review 8:\nClassification: Fake-Promotional\nConfidence: 85\nExplanation: The review is overly dramatic and promotional, with the reviewer offering to teach the business about customer service and marketing. The tone is condescending and insincere, suggesting a fake review intended to promote the reviewer's services."
  },
  {
    "id": 25,
    "rating": 5,
    "snippet": "My favourite lunch place, quiet, with air conditioning and clean washroom",
    "user": "HS P",
    "isoDate": "3 months ago",
    "profilePicture": "https://lh3.googleusercontent.com/a/ACg8ocJaH0j7SR_M3bkWbK-oyqFz3s7B-Igwth45i-ZaYJ-tkzc=s120-c-rp-mo-ba4-br100",
    "classification": "Genuine-Positive",
    "confidence": "90",
    "explanation": "The review is brief and mentions specific amenities that the reviewer enjoys, indicating a genuine positive experience.",
    "raw": "Review 1:\nClassification: Genuine-Positive\nConfidence: 90\nExplanation: The review is brief and mentions specific amenities that the reviewer enjoys, indicating a genuine positive experience.\n\n"
  },
  {
    "id": 26,
    "rating": 5,
    "snippet": "Service was ok and food quality also good",
    "user": "Ikhmal 96",
    "isoDate": "3 months ago",
    "profilePicture": "https://lh3.googleusercontent.com/a/ACg8ocKSUZpq_wiFzCwAd6B97h-X_DM7Tgv0HByU8W7xUlzYCV33kA=s120-c-rp-mo-br100",
    "classification": "Genuine-Positive",
    "confidence": "80",
    "explanation": "The review is neutral in tone, but still mentions positive aspects of the service and food quality, suggesting a genuine, albeit lukewarm, positive experience.",
    "raw": "Review 2:\nClassification: Genuine-Positive\nConfidence: 80\nExplanation: The review is neutral in tone, but still mentions positive aspects of the service and food quality, suggesting a genuine, albeit lukewarm, positive experience.\n\n"
  },
  {
    "id": 27,
    "rating": 1,
    "snippet": "No AC. They use cooler and its not powerful to cool down the restaurant. The playground outside looks like permanently closed.",
    "user": "Zakaria Ayoob",
    "isoDate": "7 months ago",
    "profilePicture": "https://lh3.googleusercontent.com/a-/ALV-UjXEnQ4U4Ixp6T5HXX__gWeQEK6hv2Em2CJ7upNED-G0VnAgz_RQ=s120-c-rp-mo-ba2-br100",
    "classification": "Genuine-Negative",
    "confidence": "95",
    "explanation": "The review specifically mentions two negative aspects of the restaurant (lack of AC and closed playground), indicating a genuine negative experience.",
    "raw": "Review 3:\nClassification: Genuine-Negative\nConfidence: 95\nExplanation: The review specifically mentions two negative aspects of the restaurant (lack of AC and closed playground), indicating a genuine negative experience.\n\n"
  },
  {
    "id": 28,
    "rating": 1,
    "snippet": "Would like to complain about a lady who worked on 7/12/2024@2220H giving a bad service at counter. Waited about 30minutes......and telling paying 40 ringgit and demanding too much. We paying customers........ Not having for free. Pls ask ur staff mind their words. If don't want to work pls go retire.",
    "user": "Parimala Perumal",
    "isoDate": "9 months ago",
    "profilePicture": "https://lh3.googleusercontent.com/a/ACg8ocLCdRLQ-zvL_HDzYoI2d_swTY57PiMtIvppgSzztGKC7ATNwQ=s120-c-rp-mo-ba2-br100",
    "classification": "Genuine-Negative",
    "confidence": "98",
    "explanation": "The review is detailed and specific, mentioning a particular incident with a staff member, including date and time, indicating a genuine negative experience. The tone is also emotional and frustrated, which is consistent with a real customer complaint.",
    "raw": "Review 4:\nClassification: Genuine-Negative\nConfidence: 98\nExplanation: The review is detailed and specific, mentioning a particular incident with a staff member, including date and time, indicating a genuine negative experience. The tone is also emotional and frustrated, which is consistent with a real customer complaint."
  }
]